export const SkillMap = {
  "ゆっくり魔法使い" : [
    ["ねがいごと","攻撃力アップI","攻撃速度アップI","クリティカルI"],
    ["ねがいごと","攻撃力アップI","攻撃速度アップI","クリティカルI"],
    ["ねがいごと","攻撃力アップI","攻撃力アップⅡ","防御力アップI","攻撃速度アップI","攻撃速度アップⅡ","クリティカルI"],
    ["ねがいごと","ヨモギ化","敵を倒すと攻撃力アップI","敵を倒すと攻撃力アップⅡ","敵を倒すと防御力アップI","敵を倒すと必殺パワーアップI","ダメージを受けると攻撃力アップI"],
    ["ねがいごと","攻撃力アップⅡ","攻撃力アップⅢ","防御力アップⅡ","攻撃速度アップⅡ","攻撃速度アップⅢ","クリティカルⅡ"],
    ["ヨモギ化","幸運","攻撃力アップⅡ","攻撃力アップⅢ","防御力アップI","クリティカルⅡ","HpアップⅡ"],
    ["カウンターポイズン","敵を倒すと攻撃力アップⅡ","敵を倒すと攻撃力アップⅢ","敵を倒すと防御力アップⅡ","敵を倒すと必殺パワーアップⅡ","敵を倒すと必殺パワーアップⅢ","ダメージを受けると攻撃力アップⅡ"],
    ["カウンターポイズン","バトンタッチ","攻撃力アップⅢ","防御力アップⅢ","攻撃速度アップⅢ","攻撃速度アップⅣ","HpアップⅢ"],
    ["カウンターポイズン","バトンタッチ","敵を倒すと攻撃力アップⅢ","敵を倒すと攻撃力アップⅣ","敵を倒すと防御力アップⅢ","敵を倒すと必殺パワーアップⅢ","ダメージを受けると攻撃力アップⅢ","ダメージを受けると攻撃力アップⅣ"]
  ],
  "狩人" : [
    ["狙撃手の目"],
    ["攻撃力アップI","クリティカルI"],
    ["幸運","攻撃力アップI","攻撃力アップⅡ","攻撃速度アップI","クリティカルI","クリティカルⅡ","HpアップI","回避I"],
    ["ヨモギ化","クリティカルⅡ","敵を倒すと必殺パワーアップI","敵を倒すと攻撃力アップI","敵を倒すと攻撃力アップⅡ","敵を倒すと防御力アップI","ダメージを受けると攻撃力アップI","ダメージを受けると必殺パワー回復I"],
    ["幸運","攻撃力アップⅡ","攻撃速度アップⅢ","クリティカルⅡ","クリティカルⅢ","HpアップⅡ","回避Ⅱ"],
    ["ヨモギ化","攻撃力アップⅡ","攻撃力アップⅢ","攻撃速度アップⅡ","クリティカルⅡ","クリティカルⅢ","HpアップⅡ"],
    ["幸運","敵を倒すと必殺パワーアップⅢ","敵を倒すと必殺パワーアップⅣ","敵を倒すと攻撃力アップⅢ","敵を倒すと攻撃力アップⅣ","敵を倒すと防御力アップⅢ","ダメージを受けると攻撃力アップⅢ","ダメージを受けると必殺パワー回復Ⅲ"],
    ["ヨモギ化","匠の技","攻撃力アップⅢ","攻撃力アップⅣ","攻撃速度アップⅢ","クリティカルⅢ","HpアップⅢ"],
    ["ライフスティール","攻撃力アップⅢ","攻撃力アップⅣ","攻撃速度アップⅢ","クリティカルⅣ","HpアップⅢ"]
  ],
  "盗賊" : [
    ["回避Ⅱ"],
    ["攻撃力アップI","クリティカルI"],
    ["ナイフカウンター","回避I","攻撃力アップⅡ","攻撃速度アップI","クリティカルI"],
    ["ナイフカウンター","ダメージリフレクト","回避I","攻撃力アップⅡ","敵を倒すと攻撃力アップI","敵を倒すと必殺パワーアップI"],
    ["回避Ⅲ"],
    ["ナイフカウンター","幸運","ぐーるぐる","攻撃力アップⅢ","攻撃速度アップⅡ","敵を倒すと攻撃力アップⅡ","敵を倒すと必殺パワーアップⅡ","ダメージを受けると攻撃力アップⅡ"],
    ["ナイフカウンター","逆境","匠の技","回避Ⅳ","攻撃力アップⅢ","クリティカルⅢ"],
    ["ナイフカウンター","ヨモギ化","ライフスティール","回避Ⅳ","敵を倒すと攻撃力アップⅢ","敵を倒すと必殺パワーアップⅢ","ダメージを受けると攻撃力アップⅢ"],
    ["ライフスティール","バトンタッチ","回避Ⅳ","攻撃力アップⅢ","攻撃速度アップⅢ","クリティカルⅢ"]
  ],
  "剣士" : [
    ["攻撃力アップI","防御力アップI","攻撃速度アップI","必殺パワーアップI","HpアップI"],
    ["攻撃力アップI","防御力アップI","攻撃速度アップI","必殺パワーアップI","HpアップI"],
    ["攻撃力アップⅡ","防御力アップI","防御力アップⅡ","必殺パワーアップI","HpアップI","HpアップⅡ"],
    ["匠の技","攻撃力アップⅡ","攻撃力アップⅢ","防御力アップⅡ","HpアップⅡ","敵を倒すと攻撃力アップI","敵を倒すと防御力アップI","敵を倒すと必殺パワーアップI","ダメージを受けると攻撃力アップI"],
    ["ガッツ","攻撃力アップⅡ","攻撃力アップⅢ","防御力アップI","防御力アップⅢ","攻撃速度アップⅡ","HpアップⅡ"],
    ["ヨモギ化","攻撃力アップⅡ","攻撃力アップⅢ","防御力アップⅡ","防御力アップⅢ","攻撃速度アップⅡ","必殺パワーアップⅡ"],
    ["匠の技","幸運","敵を倒すと攻撃力アップⅡ","敵を倒すと攻撃力アップⅢ","敵を倒すと防御力アップⅡ","敵を倒すと防御力アップⅢ","敵を倒すと必殺パワーアップⅡ","ダメージを受けると攻撃力アップⅡ"],
    ["ブリンク剣","攻撃力アップⅢ","攻撃力アップⅣ","防御力アップⅢ","防御力アップⅣ","攻撃速度アップⅢ","必殺パワーアップⅢ","HpアップⅢ"],
    ["幸運","ブリンク剣","敵を倒すと攻撃力アップⅢ","敵を倒すと攻撃力アップⅣ","敵を倒すと防御力アップⅢ","敵を倒すと防御力アップⅣ","敵を倒すと必殺パワーアップⅢ","ダメージを受けると攻撃力アップⅢ"]
  ]
}